saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Maxim.MAX32625.1.1.0-a.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package schemaVersion="1.4" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
   <vendor>Maxim</vendor>
   <name>MAX32625</name>
   <url>http://www.mxim.net/microcontroller/pack/</url>
   <description>Maxim Integrated MAX32625 and MAX32626 Device Support, Board Support Package and Examples</description>
   <supportContact>support@maximintegrated.com</supportContact>

   <license>License/END_USER_LICENSE_AGREEMENT.rtf</license>

   <releases>
      <release version="1.1.0-a" date="2018-08-06">
         - Updates to fully support IAR release 8.30
         - Updates to RTE Configuration for defintions and NVIC Virtual VecTab support.
         - IAR Project and Keil Projects moved to latest CMSIS version (5.3.0)
         - Removed requirement for CMSIS. Unable to get tools to not attempt to install CMSIS even when it's already installed.
         - Verified new CMSIS-DAP support for IAR and Keil.
      </release>
      <release version="1.0.0" date="2018-04-19">
         - Updates for pack support
         - IAR Support Updated
         - Documentation links to website for user guide and data sheet.
      </release>
      <release version="0.0.1" date="2018-03-07">
         - SDK2.6+ Release
         - IAR Support Added
         - Keil uVision Support Added
      </release>
   </releases>

   <keywords>
      <keyword>Maxim</keyword>
      <keyword>MAX32625</keyword>
      <keyword>MAX32626</keyword>
      <keyword>MAX32625 Evaluation Kit</keyword>
      <keyword>Device Support</keyword>
      <keyword>Device Family Package Maxim</keyword>
      <keyword>Maxim Evaluation Kit</keyword>
   </keywords>

   <requirements>
      <languages>
         <language name="C" version="99" />
      </languages>
   </requirements>

   <devices>
      <family Dfamily="MAX32625" Dvendor="Maxim:23">
         <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="96000000" />
         <compile header="Libraries/Device/Maxim/MAX32625/Include/max32625.h" />
         <debug svd="SVD/MAX32625/max32625.svd" />
         <description>
            The MAX32625 device family is designed for wearable and portable medical and fitness applications. The devices contain an ARM Cortex-M4 processor with FPU, execute up to 96MHz and include a 10-bit ADC and a versatile set of on-chip peripherals.
         </description>
         <book name="http://infocenter.arm.com/help/topic/com.arm.doc.dui0553a/DUI0553A_cortex_m4_dgug.pdf" title="Cortex-M4 Generic User Guide"/>
         <book name="https://datasheets.maximintegrated.com/en/ds/MAX32625.pdf" title="MAX32625 Datasheet"/>
         <book name="http://pdfserv.maximintegrated.com/en/an/AN6350.pdf" title="MAX32625 User Guide"/>

         <feature type="Timer" n="12" m="16" name="32-Bit Timers reconfigurable as 2x16-Bit Timers"/>
         <feature type="Timer" n="6" m="32"/>
         <feature type="DMA" n="6" name="Peripheral Managment Unit"/>
         <feature type="IOs" n="49"/>
         <feature type="WDT" n="3"/>
         <feature type="RTC" n="32768"/>
         <feature type="ADC" n="10" m="10" name="Sigma-Delta ADC, 7.8ksps, Two 5.5V tolerant inputs, Two 1.2V tolerant inputs"/>
         <feature type="TimerOther" n="16" name="Channel Pulse Train Engine"/>
         <feature type="SDIO" n="3" m="4" name="x1, x2 and x4 SDIO Interface"/>
         <feature type="SPI" n="3" m="24000000" name="3 SPI Masters"/>
         <feature type="SPI" n="1" m="24000000" name="1 SPI Slave"/>
         <feature type="ExtBus" n="4" name="SPI XiP at up to 24MHz for memory expansion"/>
         <feature type="I2C" n="3" name="3 I2C Masters"/>
         <feature type="I2C" n="1" name="1 I2C Slave"/>
         <feature type="UART" n="4" m="115200"/>
         <feature type="ComOther" n="1" name="1-Wire Master"/>
         <feature type="USBD" n="1" name="Full-Speed USB Device"/>
         <feature type="VCC" n="1.2" name="Core Supply Voltage"/>
         <feature type="VCC" n="1.8" m="3.6" name="1.8V - 3.6V VDD with I/O Supply Selectable Between 1.8V and 3.6V"/>
         <feature type="Temp" n="-40" m="85"/>
         <feature type="PowerMode" n="4" name="LP3 Run, LP2 PMU, LP1 Standby, LP0 Stop"/>
         <feature type="CoreOther" n="1" name="CRC Calculation Unit"/>
         <feature type="ClockOther" n="96000000" name="Internal Relaxation Oscillator with +/- 1% accuracy"/>
         <feature type="ClockOther" n="4000000" name="Low Power 4MHz Internal Ring Oscillator"/>
         <feature type="Crypto" n="128.256" name="128/256-bit Hareware Accelerated AES Encryption Engine"/>

         <device Dname="MAX32625">
            <processor Dclock="96000000"/>
            <debugconfig default="jtag" clock="1000000" swj="1"/>
            <compile header="Libraries/Device/Maxim/MAX32625/Include/max32625.h" define="MAX32625"/>
            <memory id="IROM1" start="0x00000000" size="0x00080000" startup="1" default="1"/>
            <memory id="IRAM1" start="0x20000000" size="0x00028000" init="0" default="1"/>
            <algorithm name="Flash/MAX32625.FLM" start="0x00000000" size="0x00080000" default="1"/>
            <algorithm  name="FlashIAR/FlashMAX32625.flash" start="0x00000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x00028000" default="0" style="IAR"/>
            <debug svd="SVD/MAX32625/max32625.svd"/>
         </device>

         <device Dname="MAX32626">
            <processor Dclock="96000000"/>
            <debugconfig default="jtag" clock="1000000" swj="1"/>
            <compile header="Libraries/Device/Maxim/MAX32625/Include/max32625.h" define="MAX32626"/>
            <memory id="IROM1" start="0x00000000" size="0x00080000" startup="1" default="1"/>
            <memory id="IRAM1" start="0x20000000" size="0x00028000" init="0" default="1"/>
            <algorithm name="Flash/MAX32625.FLM" start="0x00000000" size="0x00080000" default="1"/>
            <algorithm  name="FlashIAR/FlashMAX32625.flash" start="0x00000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x00028000" default="0" style="IAR"/>
            <debug svd="SVD/MAX32625/max32625.svd"/>
         </device>
      </family>

   </devices>

