saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Maxim.MAX32625.1.1.0-a.pdsc
      <example name="Timer" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32625_EVKIT/Timer">
         <description>32/16-bit Timer Demo</description>
         <board name="MAX32625_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="ARM/Timer.uvprojx"/>
            <environment name="iar" load="IAR/Timer.ewp" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32625 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE" Cversion="5.3.0"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <component Cclass="HAL" Cgroup="Hardware Access Layer"/>
            <component Cclass="Peripherals" Cgroup="GPIO"/>
            <component Cclass="Peripherals" Cgroup="Timers"/>
            <component Cclass="Communications" Cgroup="SPI Master"/>
            <component Cclass="Communications" Cgroup="I2C Master"/>
            <component Cclass="Communications" Cgroup="UART"/>
            <component Cbundle="MAX32625 EVKIT Board Support" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
            <keyword>Timers</keyword>
         </attributes>
      </example>

      <example name="UART" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32625_EVKIT/UART">
         <description>UART Demo</description>
         <board name="MAX32625_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="ARM/UART.uvprojx"/>
            <environment name="iar" load="IAR/UART.ewp" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32625 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE" Cversion="5.3.0"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <component Cclass="HAL" Cgroup="Hardware Access Layer"/>
            <component Cclass="Peripherals" Cgroup="GPIO"/>
            <component Cclass="Communications" Cgroup="SPI Master"/>
            <component Cclass="Communications" Cgroup="I2C Master"/>
            <component Cclass="Communications" Cgroup="UART"/>
            <component Cbundle="MAX32625 EVKIT Board Support" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
            <keyword>Communications</keyword>
            <keyword>UART</keyword>
         </attributes>
      </example>

      <example name="USB_CDCACM" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32625_EVKIT/USB_CDCACM">
         <description>USB CDCACM Serial Port Example</description>
         <board name="MAX32625_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="ARM/USB_CDCACM.uvprojx"/>
            <environment name="iar" load="IAR/USB_CDCACM.ewp" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32625 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE" Cversion="5.3.0" />
            <component Cclass="Device" Cgroup="Startup" />
            <component Cclass="HAL" Cgroup="Hardware Access Layer" />
            <component Cclass="Peripherals" Cgroup="GPIO"/>
            <component Cclass="Peripherals" Cgroup="WDT" Csub="WDT1" />
            <component Cclass="Communications" Cgroup="SPI Master" />
            <component Cclass="Communications" Cgroup="I2C Master" />
            <component Cclass="Communications" Cgroup="UART" />
            <component Cbundle="MAX32625 EVKIT Board Support" Cclass="BSP" Cgroup="Board Support" />
            <component Cbundle="MAXUSB Libraries" Cclass="MAXUSB" Cgroup="MAXUSB" />
            <keyword>Getting Started</keyword>
            <keyword>USB</keyword>
            <keyword>CDC</keyword>
            <keyword>ACM</keyword>
         </attributes>
      </example>

      <example name="USB_HIDKeyboard" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32625_EVKIT/USB_HIDKeyboard">
         <description>USB HID Keyboard Example Application</description>
         <board name="MAX32625_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="ARM/USB_HIDKeyboard.uvprojx"/>
            <environment name="iar" load="IAR/USB_HIDKeyboard.ewp" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32625 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE" Cversion="5.3.0" />
            <component Cclass="Device" Cgroup="Startup" />
            <component Cclass="HAL" Cgroup="Hardware Access Layer" />
            <component Cclass="Peripherals" Cgroup="GPIO"/>
            <component Cclass="Peripherals" Cgroup="WDT" Csub="WDT1" />
            <component Cclass="Communications" Cgroup="SPI Master" />
            <component Cclass="Communications" Cgroup="I2C Master" />
            <component Cclass="Communications" Cgroup="UART" />
            <component Cbundle="MAX32625 EVKIT Board Support" Cclass="BSP" Cgroup="Board Support" />
            <component Cbundle="MAXUSB Libraries" Cclass="MAXUSB" Cgroup="MAXUSB" />
            <keyword>Getting Started</keyword>
            <keyword>USB</keyword>
            <keyword>HID</keyword>
         </attributes>
      </example>

      <example name="USB_HIDKeyboardLP1" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32625_EVKIT/USB_HIDKeyboardLP1">
         <description>USB HID Keyboard Example Application with Low Power Mode 1 Support</description>
         <board name="MAX32625_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="ARM/USB_HIDKeyboardLP1.uvprojx"/>
            <environment name="iar" load="IAR/USB_HIDKeyboardLP1.ewp" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32625 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE" Cversion="5.3.0" />
            <component Cclass="Device" Cgroup="Startup" />
            <component Cclass="HAL" Cgroup="Hardware Access Layer" />
            <component Cclass="Peripherals" Cgroup="GPIO"/>
            <component Cclass="Peripherals" Cgroup="WDT" Csub="WDT1" />
            <component Cclass="Communications" Cgroup="SPI Master" />
            <component Cclass="Communications" Cgroup="I2C Master" />
            <component Cclass="Communications" Cgroup="UART" />
            <component Cbundle="MAX32625 EVKIT Board Support" Cclass="BSP" Cgroup="Board Support" />
            <component Cbundle="MAXUSB Libraries" Cclass="MAXUSB" Cgroup="MAXUSB" />
            <keyword>Getting Started</keyword>
            <keyword>USB</keyword>
            <keyword>Low Power</keyword>
            <keyword>HID</keyword>
            <keyword>Keyboard</keyword>
         </attributes>
      </example>

      <example name="USB_HIDRaw" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32625_EVKIT/USB_HIDRaw">
         <description>USB HID raw device example application</description>
         <board name="MAX32625_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="ARM/USB_HIDRaw.uvprojx"/>
            <environment name="iar" load="IAR/USB_HIDRaw.ewp" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32625 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE" Cversion="5.3.0" />
            <component Cclass="Device" Cgroup="Startup" />
            <component Cclass="HAL" Cgroup="Hardware Access Layer" />
            <component Cclass="Peripherals" Cgroup="GPIO"/>
            <component Cclass="Peripherals" Cgroup="WDT" Csub="WDT1" />
            <component Cclass="Communications" Cgroup="SPI Master" />
            <component Cclass="Communications" Cgroup="I2C Master" />
            <component Cclass="Communications" Cgroup="UART" />
            <component Cbundle="MAX32625 EVKIT Board Support" Cclass="BSP" Cgroup="Board Support" />
            <component Cbundle="MAXUSB Libraries" Cclass="MAXUSB" Cgroup="MAXUSB" />
            <keyword>Getting Started</keyword>
            <keyword>USB</keyword>
            <keyword>HID</keyword>
            <keyword>Raw</keyword>
         </attributes>
      </example>

